demo-output/website/campaign/F4_runs/cyl/M8.0/coarse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       1930;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       1980;
    }
    farfield
    {
        type            patch;
        nFaces          50;
        startFace       2000;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          20;
        startFace       2050;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2000;
        startFace       2070;
    }
)

// ************************************************************************* //
